export const dict = {
	'share': 'Поделиться',
	'edit_profile': 'Профиль',
	'correct': 'Правильные',
	'rank': 'Ранг',
	'points_earned': 'Заработанные очки',
	'max_streak': 'Макс. серия',
	'check_out_profile': 'Посмотрите профиль {first_name}',
	'first_name': 'Имя',
	'last_name': 'Фамилия',
	'favorite_team': () => <>Ваш любимый клуб. <span class="text-primary">+3 очка</span> за правильный прогноз.</>,
	'select_favorite_team': 'Выберите любимую команду',
	'search_team': 'Поиск команды',
	'save_and_close': 'Сохранить и закрыть',
	'close': 'Закрыть',
	'join_community': 'Присоединиться к сообществу',
	'join_community_description': 'Для обсуждения матчей и получения последних обновлений',
	'open_in_telegram': 'Открыть в Telegram',
	'monthly_seasons': '🏅 Ежемесячные сезоны!',
	'monthly_seasons_description': 'Соревнуйтесь за первое место каждый месяц! Очки сбрасываются ежемесячно, а победитель получает приз. 🏆 Сделайте ваши прогнозы важными!',
	'season_ends_on': (date: any) => <>Сезон заканчивается <span class="text-primary">{date}</span></>,
	'big_season_ends_on': (date: any) => <>Большой сезон совпадает с футбольным сезоном и заканчивается <span
		class="text-primary">{date}</span></>,
	'matches': 'Матчи',
	'leaderboard': 'Таблица лидеров',
	'user_position': 'Позиция',
	'points': 'Очки',
	'favorite_team_icon': 'Любимая команда',
	'match_duration': '{days}д {hours}ч {minutes}м',
	'active_season': 'Активный сезон {{name}}',
	'show_more': 'Показать больше',
	'big_season': 'Большой сезон',
	'your_predictions': 'Ваши прогнозы',
	'win_1': 'П1',
	'win_2': 'П2',
	'draw': 'Ничья',
	'exact_score': 'Точный счет',
	'save': 'Сохранить',
	'onboarding': [
		{
			title: 'Добро пожаловать в MatchPredict!',
			description: 'Делайте прогнозы на предстоящие матчи и зарабатывайте очки.',
		},
		{
			title: 'Зарабатывайте очки',
			description: <span>Угадайте точный счет, чтобы получить <span class="text-primary font-semibold">+7 очков</span>, или предскажите исход, чтобы заработать <span
				class="text-primary font-semibold">+3 очка.</span> Очки фиксируются с началом матча.</span>,
		},
		{
			title: 'Бонусы за серию успехов',
			description: 'Сохраняйте серию правильных прогнозов, чтобы зарабатывать бонусные очки. Чем дольше серия, тем выше бонус!',
		},
		{
			title: 'Приглашайте друзей',
			description: <span>Пригласите друзей в MatchPredict и получайте <span
				class="text-primary font-semibold">10%</span> от их заработанных очков за прогнозы. Расширяйте свою сеть и свои награды!</span>,
		},
		{
			title: 'Поднимайтесь в таблице лидеров',
			description: 'Соревнуйтесь с другими участниками и поднимайтесь в таблице лидеров каждый сезон. Лучшие игроки получат увлекательные призы!',
		},
		{
			title: 'Начнем!',
			description: 'Давайте начнем предсказывать результаты матчей. Удачи!',
		},
	],
}

